In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.50120042, -0.70845568, -1.60884547],
       [-0.06816638, -0.97208287, -1.03964542],
       [-1.16753511, -0.16024904, -1.14783342],
       [ 1.77640295,  0.58576201, -0.5289231 ]])

In [4]:
data_frame_deneme = pd.Series(data)

ValueError: Data must be 1-dimensional, got ndarray of shape (4, 3) instead

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

          0         1         2
0 -0.501200 -0.708456 -1.608845
1 -0.068166 -0.972083 -1.039645
2 -1.167535 -0.160249 -1.147833
3  1.776403  0.585762 -0.528923

In [7]:
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
data_frame[0]

0   -0.501200
1   -0.068166
2   -1.167535
3    1.776403
Name: 0, dtype: float64

In [9]:
type(data_frame[0])

pandas.core.series.Series

In [13]:
new_df = pd.DataFrame(data, index = ["Adem", "Derya", "Deniz", "Ahmet"], columns = ["Salary", "Age", "Seniority"])

In [14]:
new_df

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [15]:
new_df["Age"]

Adem    -0.708456
Derya   -0.972083
Deniz   -0.160249
Ahmet    0.585762
Name: Age, dtype: float64

In [16]:
new_df["Salary"]

Adem    -0.501200
Derya   -0.068166
Deniz   -1.167535
Ahmet    1.776403
Name: Salary, dtype: float64

In [18]:
new_df[["Age", "Salary"]]

            Age    Salary
Adem  -0.708456 -0.501200
Derya -0.972083 -0.068166
Deniz -0.160249 -1.167535
Ahmet  0.585762  1.776403

In [19]:
new_df.loc["Adem"]

Salary      -0.501200
Age         -0.708456
Seniority   -1.608845
Name: Adem, dtype: float64

In [20]:
new_df.iloc[0]

Salary      -0.501200
Age         -0.708456
Seniority   -1.608845
Name: Adem, dtype: float64

In [21]:
new_df.iloc[1]

Salary      -0.068166
Age         -0.972083
Seniority   -1.039645
Name: Derya, dtype: float64

In [22]:
new_df

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [24]:
new_df.iloc[:,1] # iki nokta üst üste tüm satırları seç demek sonrasında ki değer ise ilgili kolonu getir demek.

Adem    -0.708456
Derya   -0.972083
Deniz   -0.160249
Ahmet    0.585762
Name: Age, dtype: float64

In [25]:
new_df.iloc[:,0]

Adem    -0.501200
Derya   -0.068166
Deniz   -1.167535
Ahmet    1.776403
Name: Salary, dtype: float64

In [26]:
new_df.iloc[:,2]

Adem    -1.608845
Derya   -1.039645
Deniz   -1.147833
Ahmet   -0.528923
Name: Seniority, dtype: float64

In [27]:
new_df["Age"]

Adem    -0.708456
Derya   -0.972083
Deniz   -0.160249
Ahmet    0.585762
Name: Age, dtype: float64

In [28]:
new_df["Extra"] = 10

In [29]:
new_df

         Salary       Age  Seniority  Extra
Adem  -0.501200 -0.708456  -1.608845     10
Derya -0.068166 -0.972083  -1.039645     10
Deniz -1.167535 -0.160249  -1.147833     10
Ahmet  1.776403  0.585762  -0.528923     10

In [30]:
new_df.drop("Extra", axis=1) # axis -> eksen, 1 -> kolonlar, 0 -> satırlar

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [31]:
new_df

         Salary       Age  Seniority  Extra
Adem  -0.501200 -0.708456  -1.608845     10
Derya -0.068166 -0.972083  -1.039645     10
Deniz -1.167535 -0.160249  -1.147833     10
Ahmet  1.776403  0.585762  -0.528923     10

In [32]:
# Extra kolonunu sildik ancak data frame ataması yapmadık bunun için ya
# new_df = new_df.drop("Extra") yaparız ya da 
# new_df.drop("Extra", axis = 1, inplace = True) yaparız.

In [33]:
new_df.drop("Extra", axis = 1, inplace = True)

In [35]:
new_df

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [36]:
new_df["Ahmet"] = 10

In [37]:
new_df

         Salary       Age  Seniority  Ahmet
Adem  -0.501200 -0.708456  -1.608845     10
Derya -0.068166 -0.972083  -1.039645     10
Deniz -1.167535 -0.160249  -1.147833     10
Ahmet  1.776403  0.585762  -0.528923     10

In [38]:
new_df.drop("Ahmet")

         Salary       Age  Seniority  Ahmet
Adem  -0.501200 -0.708456  -1.608845     10
Derya -0.068166 -0.972083  -1.039645     10
Deniz -1.167535 -0.160249  -1.147833     10

In [39]:
new_df

         Salary       Age  Seniority  Ahmet
Adem  -0.501200 -0.708456  -1.608845     10
Derya -0.068166 -0.972083  -1.039645     10
Deniz -1.167535 -0.160249  -1.147833     10
Ahmet  1.776403  0.585762  -0.528923     10

In [40]:
new_df.drop("Ahmet", axis=1, inplace=True)

In [41]:
new_df

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [42]:
new_df.drop("Ahmet", axis=0)

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833

In [43]:
new_df

         Salary       Age  Seniority
Adem  -0.501200 -0.708456  -1.608845
Derya -0.068166 -0.972083  -1.039645
Deniz -1.167535 -0.160249  -1.147833
Ahmet  1.776403  0.585762  -0.528923

In [45]:
new_df.loc["Derya"]

Salary      -0.068166
Age         -0.972083
Seniority   -1.039645
Name: Derya, dtype: float64

In [46]:
new_df.loc["Derya"]["Salary"]

np.float64(-0.06816637895872339)

In [47]:
new_df.loc["Derya", "Salary"]

np.float64(-0.06816637895872339)

In [48]:
new_df.loc["Derya", "Salary"] = 100

In [50]:
new_df

           Salary       Age  Seniority
Adem    -0.501200 -0.708456  -1.608845
Derya  100.000000 -0.972083  -1.039645
Deniz   -1.167535 -0.160249  -1.147833
Ahmet    1.776403  0.585762  -0.528923

In [51]:
new_df > 0

       Salary    Age  Seniority
Adem    False  False      False
Derya    True  False      False
Deniz   False  False      False
Ahmet    True   True      False

In [52]:
new_df[new_df > 0]

           Salary       Age  Seniority
Adem          NaN       NaN        NaN
Derya  100.000000       NaN        NaN
Deniz         NaN       NaN        NaN
Ahmet    1.776403  0.585762        NaN

In [53]:
boolean_frame = new_df > 0

In [55]:
new_df[boolean_frame]

           Salary       Age  Seniority
Adem          NaN       NaN        NaN
Derya  100.000000       NaN        NaN
Deniz         NaN       NaN        NaN
Ahmet    1.776403  0.585762        NaN

In [56]:
new_df[new_df > 0]

           Salary       Age  Seniority
Adem          NaN       NaN        NaN
Derya  100.000000       NaN        NaN
Deniz         NaN       NaN        NaN
Ahmet    1.776403  0.585762        NaN

In [57]:
new_df[new_df["Salary"] > 1]

           Salary       Age  Seniority
Derya  100.000000 -0.972083  -1.039645
Ahmet    1.776403  0.585762  -0.528923

In [58]:
new_df

           Salary       Age  Seniority
Adem    -0.501200 -0.708456  -1.608845
Derya  100.000000 -0.972083  -1.039645
Deniz   -1.167535 -0.160249  -1.147833
Ahmet    1.776403  0.585762  -0.528923

In [59]:
new_df[new_df["Age"] > 1]

Empty DataFrame
Columns: [Salary, Age, Seniority]
Index: []

In [60]:
new_df[new_df["Seniority"] > 1]

Empty DataFrame
Columns: [Salary, Age, Seniority]
Index: []

In [61]:
new_df[new_df["Age"] > 0]

         Salary       Age  Seniority
Ahmet  1.776403  0.585762  -0.528923

In [62]:
new_df

           Salary       Age  Seniority
Adem    -0.501200 -0.708456  -1.608845
Derya  100.000000 -0.972083  -1.039645
Deniz   -1.167535 -0.160249  -1.147833
Ahmet    1.776403  0.585762  -0.528923

In [63]:
new_df.reset_index()

   index      Salary       Age  Seniority
0   Adem   -0.501200 -0.708456  -1.608845
1  Derya  100.000000 -0.972083  -1.039645
2  Deniz   -1.167535 -0.160249  -1.147833
3  Ahmet    1.776403  0.585762  -0.528923

In [64]:
new_df

           Salary       Age  Seniority
Adem    -0.501200 -0.708456  -1.608845
Derya  100.000000 -0.972083  -1.039645
Deniz   -1.167535 -0.160249  -1.147833
Ahmet    1.776403  0.585762  -0.528923

In [65]:
reset_frame = new_df.reset_index()

In [66]:
reset_frame

   index      Salary       Age  Seniority
0   Adem   -0.501200 -0.708456  -1.608845
1  Derya  100.000000 -0.972083  -1.039645
2  Deniz   -1.167535 -0.160249  -1.147833
3  Ahmet    1.776403  0.585762  -0.528923

In [67]:
reset_frame.loc[0]

index            Adem
Salary        -0.5012
Age         -0.708456
Seniority   -1.608845
Name: 0, dtype: object

In [68]:
reset_frame.iloc[0]

index            Adem
Salary        -0.5012
Age         -0.708456
Seniority   -1.608845
Name: 0, dtype: object

In [69]:
new_indices = ["Ade", "Der", "Den", "Ahm"]

In [70]:
new_df["NewIndex"] = new_indices

In [71]:
new_df

           Salary       Age  Seniority NewIndex
Adem    -0.501200 -0.708456  -1.608845      Ade
Derya  100.000000 -0.972083  -1.039645      Der
Deniz   -1.167535 -0.160249  -1.147833      Den
Ahmet    1.776403  0.585762  -0.528923      Ahm

In [73]:
new_df.set_index("NewIndex", inplace=True)

In [74]:
new_df

              Salary       Age  Seniority
NewIndex
Ade        -0.501200 -0.708456  -1.608845
Der       100.000000 -0.972083  -1.039645
Den        -1.167535 -0.160249  -1.147833
Ahm         1.776403  0.585762  -0.528923

In [75]:
new_df.loc["Ade"]

Salary      -0.501200
Age         -0.708456
Seniority   -1.608845
Name: Ade, dtype: float64

In [76]:
# multi index

In [77]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [78]:
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [79]:
zipped_index = list(zip(first_index, inner_index))

In [80]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [81]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [82]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [83]:
sample_values = np.ones((6,2))

In [85]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns= ["Age", "Salary"])

In [86]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [87]:
big_df['Age']

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [89]:
# big_df.loc["Homer"]

In [90]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [91]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64